app/controllers/app_controller.rb

SELECT  1 AS one FROM "search_histories" WHERE (q_username = 'alex') LIMIT $1  [["LIMIT", 1]]
INSERT INTO "search_histories" ("q_username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["q_username", "josh"], ["created_at", "2019-02-19 20:28:46.372586"], ["updated_at", "2019-02-19 20:28:46.372586"]]
---
  def show
    if !SearchHistory.exists? ["q_username = ?", params[:username]]
      SearchHistory.create(:q_username=>params[:username])
    end
    user_id = Github::User.get_user_id(params[:username])
    @user = Github::User.find(params[:username], user_id.id)
    top_langs = {}
    @user.contributions_collection.commit_contributions_by_repository.each do |repository|
      repository.repository.languages.nodes.each do |lang|
        if top_langs.key?(lang.name)
          top_langs[lang.name] = top_langs[lang.name] + 1
        else
          top_langs[lang.name] = 1
        end
      end
    end
    @top_langages = top_langs.sort_by {|k, v| v}.reverse[0..2]
    if !SearchHistory.exists? ["q_username = ?", params[:username]]

SELECT  "search_histories".* FROM "search_histories" ORDER BY "search_histories"."id" DESC LIMIT $1  [["LIMIT", 20]]
---
  def list_history
    @search_history = SearchHistory.last(20)